yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
/* ==========================================================================
 * PROJECT: Adaptive Robotized Manual Transmission Controller
 * MCU: STM32F103C8T6 (Blue Pill)
 * VERSION: 1.3 (FINAL FIXED)
 * DESCRIPTION: Complete controller for a robotized manual gearbox.
 *              All known issues resolved:
 *              - USART3 remapped to PC10/PC11 (no pin conflict with Y limits)
 *              - auto_mode_enabled removed (use current_drive_mode)
 *              - Analog tachometer implemented (TIM4, PB6)
 *              - Wheel speed difference for AWD (CAN extensible)
 *              - Stack-safe buffers (UART_MSG_BUF_SIZE = 64)
 *              - Flash address range check added
 * ========================================================================== */

 /* ========== 1. INCLUDES ========== */
#include "main.h"
#include "stm32f1xx_hal.h"
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>

// #define USE_SD_CARD   // Uncomment only if ff.c and diskio.c are present

#ifdef USE_SD_CARD
#include "ff.h"
#include "diskio.h"
#endif

/* ========== 2. SYSTEM MACROS & CONSTANTS ========== */
#define CALIB_FLASH_ADDR        0x0800FC00   // Last 1KB page of 64KB Flash
#define CAN_PROFILE_FLASH_ADDR  0x0800F800   // Dedicated 1KB page
#define ERROR_LOG_ADDR          0x0800F000   // 4KB page for error logs
#define CALIB_MAGIC             0xA5C3F0F0
#define ERROR_LOG_MAX_ENTRIES   50
#define IDLE_TIMEOUT_MS         5000
#define SENSOR_TOLERANCE        100
#define FILTER_ALPHA            0.2f
#define MAX_CALIB_STEPS         5000
#define BACKOFF_STEPS           50
#define CLUTCH_TIMEOUT_MS       5000
#define UART_MSG_BUF_SIZE       64            // Safe for stack

/* ========== 3. DATA STRUCTURES ========== */
typedef struct {
    uint16_t angle_disengaged;
    uint16_t angle_engaged;
    uint16_t angle_bite_point;
    uint8_t  calibrated;
} ClutchCalibration;

typedef struct {
    int32_t left_limit;
    int32_t right_limit;
    int32_t home_offset;
    int32_t backlash;
    uint8_t calibrated;
} AxisCalibration;

typedef struct __attribute__((packed)) {
    uint32_t magic;
    uint16_t crc;
    uint8_t  version;
    uint16_t clutch_disengaged;
    uint16_t clutch_engaged;
    uint16_t clutch_bite;
    int32_t  x_left_limit;
    int32_t  x_right_limit;
    int32_t  x_home;
    int32_t  x_backlash;
    int32_t  y_front_limit;
    int32_t  y_back_limit;
    int32_t  y_home;
    int32_t  y_backlash;
    int32_t  gear_positions[7][2];
    uint8_t  calibrated;
} CalibrationData;

typedef struct {
    uint16_t raw_min;
    uint16_t raw_max;
    float scale;
    uint8_t calibrated;
} BackupSensorCalibration;

typedef struct {
    uint16_t rpm_id;
    uint8_t rpm_offset;
    uint8_t rpm_length;
    uint8_t rpm_factor;
    uint8_t rpm_big_endian;
    uint16_t speed_id;
    uint8_t speed_offset;
    uint8_t speed_length;
    uint8_t speed_factor;
    uint8_t speed_big_endian;
    uint16_t throttle_id;
    uint8_t throttle_offset;
    uint8_t throttle_length;
    uint8_t throttle_factor;
    uint16_t brake_id;
    uint8_t brake_offset;
    uint8_t brake_bit;
    /* Extended for AWD wheel speed difference */
    uint16_t front_speed_id;
    uint8_t front_speed_offset;
    uint8_t front_speed_length;
    uint16_t rear_speed_id;
    uint8_t rear_speed_offset;
    uint8_t rear_speed_length;
} CanProfile;

typedef struct {
    uint32_t timestamp;
    uint8_t  error_code;
    uint8_t  severity;
    uint16_t data;
} ErrorLogEntry;

typedef struct {
    uint8_t throttle;
    uint16_t upshift_rpm;
    uint16_t downshift_rpm;
} ShiftMapEntry;

typedef struct {
    uint8_t clutch_disengage_speed;
    uint8_t clutch_engage_speed;
    uint16_t clutch_hold_time_ms;
    uint16_t shift_delay_us;
    uint8_t use_bite_point;
    uint8_t throttle_blip;
    uint16_t max_rpm_shift;
    uint8_t start_from_second;
} DriveParameters;

typedef struct {
    uint8_t awd_enable_pin;
    uint8_t awd_pwm_channel;
    uint16_t awd_engage_delay_ms;
    uint16_t awd_max_temp;
    uint8_t awd_auto_speed_diff;
    uint8_t awd_lock_timeout_s;
} AwdConfig;

/* ========== 4. ENUMERATIONS ========== */
typedef enum {
    CAL_STATE_IDLE = 0,
    CAL_STATE_CLUTCH,
    CAL_STATE_AXIS_X,
    CAL_STATE_AXIS_Y,
    CAL_STATE_BACKLASH,
    CAL_STATE_GEAR_POSITIONS,
    CAL_STATE_SAVE,
    CAL_STATE_DONE,
    CAL_STATE_ERROR
} CalibrationState;

typedef enum {
    CLUTCH_DISENGAGE,
    CLUTCH_ENGAGE,
    CLUTCH_TO_BITE
} ClutchAction;

typedef enum {
    PRIMARY_AS5600,
    BACKUP_POTENTIOMETER,
    SENSOR_FAULT
} ActiveClutchSensor;

typedef enum {
    DRIVE_MODE_COMFORT = 0,
    DRIVE_MODE_NORMAL = 1,
    DRIVE_MODE_SPORT = 2,
    DRIVE_MODE_WINTER = 3
} DriveMode;

typedef enum {
    AWD_MODE_2WD = 0,
    AWD_MODE_AUTO = 1,
    AWD_MODE_LOCK = 2,
    AWD_MODE_LOW = 3
} AwdMode;

/* ========== 5. ERROR CODES ========== */
#define ERR_NONE                0
#define ERR_CURRENT_OVER_X      1
#define ERR_CURRENT_OVER_Y      2
#define ERR_CURRENT_OVER_CLUTCH 3
#define ERR_LIMIT_SWITCH_STUCK  4
#define ERR_STEPPER_STALL       5
#define ERR_CLUTCH_TIMEOUT      6
#define ERR_AS5600_MISSING      7
#define ERR_GEAR_NOT_FOUND      8
#define ERR_SHIFT_TIMEOUT       9
#define ERR_WATCHDOG_RESET      10
#define ERR_EMERGENCY_BUTTON    11

/* ========== 6. GLOBAL VARIABLES ========== */
I2C_HandleTypeDef hi2c1;
SPI_HandleTypeDef hspi2;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart3;
CAN_HandleTypeDef hcan1;
ADC_HandleTypeDef hadc1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim4;         // For analog tachometer
IWDG_HandleTypeDef hiwdg;

CalibrationData cal_data = { 0 };
ClutchCalibration clutch_cal = { 0 };
AxisCalibration cal_X = { 0 };
AxisCalibration cal_Y = { 0 };
BackupSensorCalibration backup_cal = { 0 };
CanProfile current_profile = { 0 };

volatile uint8_t current_gear = 0;
volatile uint8_t current_shift_target_gear = 0;
volatile uint8_t shifting_in_progress = 0;
volatile DriveMode current_drive_mode = DRIVE_MODE_NORMAL;
volatile CalibrationState cal_state = CAL_STATE_IDLE;
volatile uint8_t calibration_started = 0;
volatile uint8_t calibration_running = 0;
volatile uint8_t calibration_error = 0;
volatile uint8_t calibration_success = 0;
volatile uint8_t cal_in_progress = 0;
volatile uint8_t abort_calibration = 0;
volatile uint8_t system_sleeping = 0;
volatile uint8_t limp_mode_active = 0;
volatile uint32_t can_loss_timer = 0;
volatile uint8_t is_parked = 0;
volatile uint32_t engine_off_timer = 0;
volatile bool as5600_comm_ok = false;

int32_t current_x_steps = 0;
int32_t current_y_steps = 0;

volatile uint16_t engine_rpm = 0;
volatile uint8_t vehicle_speed_kmh = 0;
volatile uint8_t throttle_percent = 0;
volatile uint8_t brake_pressed = 0;
volatile uint8_t shift_paddle_up = 0;
volatile uint8_t shift_paddle_down = 0;
uint8_t can_profile_valid = 0;
uint16_t filtered_rpm = 0;
uint8_t filtered_throttle = 0;

volatile uint8_t limit_x_left_triggered = 0;
volatile uint8_t limit_x_right_triggered = 0;
volatile uint8_t limit_y_front_triggered = 0;
volatile uint8_t limit_y_back_triggered = 0;
volatile uint8_t clutch_endstop_triggered = 0;

uint16_t clutch_raw_angle = 0;
volatile uint16_t clutch_backup_sensor_raw = 0;
volatile ActiveClutchSensor active_sensor = PRIMARY_AS5600;
volatile uint8_t as5600_fault = 0;

