yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
ErrorLogEntry error_buffer[ERROR_LOG_MAX_ENTRIES];
uint8_t error_index = 0;
uint8_t error_count = 0;

volatile uint32_t last_activity_time = 0;
volatile uint32_t auto_calib_timer = 0;

volatile AwdMode current_awd_mode = AWD_MODE_2WD;
volatile uint8_t awd_engaged = 0;
volatile uint32_t awd_engagement_time = 0;
AwdConfig awd_config = {
    .awd_enable_pin = GPIO_PIN_4,
    .awd_pwm_channel = 0,
    .awd_engage_delay_ms = 200,
    .awd_max_temp = 0,
    .awd_auto_speed_diff = 10,
    .awd_lock_timeout_s = 30
};

/* For AWD wheel speed difference (CAN extended) */
volatile uint16_t front_wheel_speed_raw = 0;   // in 0.1 km/h
volatile uint16_t rear_wheel_speed_raw = 0;

const ShiftMapEntry shift_map[] = {
    {  0, 4000, 1500 }, { 20, 4500, 1800 }, { 40, 5000, 2200 },
    { 60, 5500, 2800 }, { 80, 6000, 3400 }, {100, 6500, 4000 }
};
#define SHIFT_MAP_SIZE (sizeof(shift_map)/sizeof(shift_map[0]))

const DriveParameters params_table[4] = {
    [DRIVE_MODE_COMFORT] = {60, 30, 200, 800, 1, 0, 6000, 0},
    [DRIVE_MODE_NORMAL] = {80, 50, 120, 500, 1, 0, 6000, 0},
    [DRIVE_MODE_SPORT] = {100, 80, 50, 300, 0, 1, 6500, 0},
    [DRIVE_MODE_WINTER] = {70, 35, 300, 700, 1, 0, 3000, 1}
};

const CanProfile known_profiles[] = {
    {0x0C,0,2,4,1, 0x0D,0,1,1,1, 0x11,0,1,1, 0x1A,0,0, 0,0,0, 0,0,0},
    {0x280,2,2,4,1, 0x2A0,2,2,100,1, 0x2A0,0,1,1, 0x2A0,3,0, 0,0,0, 0,0,0},
    {0x2C0,0,2,4,1, 0x2C0,2,1,1,1, 0x2C0,3,1,1, 0x2C0,4,0, 0,0,0, 0,0,0},
    {0x0A0,0,2,4,1, 0x0A0,2,1,1,1, 0x0A0,3,1,1, 0x0A0,4,0, 0,0,0, 0,0,0}
};
#define NUM_PROFILES (sizeof(known_profiles)/sizeof(known_profiles[0]))

int16_t current_offsets[3] = { 0 };

#define BT_BUF_SIZE 32
char bt_buffer[BT_BUF_SIZE];
volatile uint8_t bt_index = 0, bt_cmd_ready = 0;

#define UART_BUF_SIZE 32
char uart_rx_buf[UART_BUF_SIZE];
volatile uint8_t uart_rx_index = 0, uart_cmd_ready = 0;

const char* gear_names[] = { "N", "1", "2", "3", "4", "5", "R" };

/* Analog tachometer globals */
volatile uint16_t engine_rpm_analog = 0;
static volatile uint32_t tacho_period_us = 0;
static volatile uint32_t tacho_last_capture = 0;

/* ========== 7. FUNCTION PROTOTYPES ========== */
void SystemClock_Config(void);
void Error_Handler(void);
static void DWT_Init(void);
static void sleep_us(uint32_t us);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI2_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_CAN1_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM4_Init(void);
void IWDG_Init(void);
void IWDG_Refresh(void);

/* Steppers and clutch (short inline functions) */
void stepper_enable_x(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_RESET); }
void stepper_disable_x(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); }
void stepper_set_direction_x(uint8_t dir) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, dir ? GPIO_PIN_SET : GPIO_PIN_RESET); }
void stepper_step_x(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET); sleep_us(5); HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); sleep_us(5); }
void stepper_move_x(uint32_t steps, uint32_t delay_us) { if (!steps)return; stepper_enable_x(); for (uint32_t i = 0; i < steps; i++) { stepper_step_x(); current_x_steps += (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_SET) ? 1 : -1; if (delay_us)sleep_us(delay_us); if ((i & 0xFF) == 0)IWDG_Refresh(); } }
void stepper_enable_y(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET); }
void stepper_disable_y(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET); }
void stepper_set_direction_y(uint8_t dir) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, dir ? GPIO_PIN_SET : GPIO_PIN_RESET); }
void stepper_step_y(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET); sleep_us(5); HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_RESET); sleep_us(5); }
void stepper_move_y(uint32_t steps, uint32_t delay_us) { if (!steps)return; stepper_enable_y(); for (uint32_t i = 0; i < steps; i++) { stepper_step_y(); current_y_steps += (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4) == GPIO_PIN_SET) ? 1 : -1; if (delay_us)sleep_us(delay_us); if ((i & 0xFF) == 0)IWDG_Refresh(); } }

void clutch_set_direction(uint8_t dir) {
    if (dir == 0) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_SET); HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET); }
    else { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_RESET); HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET); }
}
void clutch_set_speed(uint8_t duty) { uint32_t p = duty * 10; if (p > 1000)p = 1000; __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, p); }
void clutch_stop(void) { clutch_set_speed(0); HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_RESET); HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET); }
uint8_t clutch_is_endstop_triggered(void) { return (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_1) == GPIO_PIN_RESET) ? 1 : 0; }

uint8_t AS5600_Init(void) { uint8_t s = 0; return (HAL_I2C_Mem_Read(&hi2c1, 0x36 << 1, 0x0B, I2C_MEMADD_SIZE_8BIT, &s, 1, 100) == HAL_OK) ? 1 : 0; }
uint16_t AS5600_ReadAngle(void) {
    uint8_t b[2];
    if (HAL_I2C_Mem_Read(&hi2c1, 0x36 << 1, 0x0C, I2C_MEMADD_SIZE_8BIT, b, 2, 100) == HAL_OK) { as5600_comm_ok = true; clutch_raw_angle = ((uint16_t)b[0] << 8) | b[1]; return clutch_raw_angle; }
    as5600_comm_ok = false; return 0xFFFF;
}

uint16_t clutch_find_disengaged(void) {
    clutch_set_direction(0); clutch_set_speed(30);
    uint32_t t = HAL_GetTick() + CLUTCH_TIMEOUT_MS;
    while (!clutch_is_endstop_triggered() && HAL_GetTick() < t) { HAL_Delay(10); IWDG_Refresh(); }
    clutch_stop();
    return clutch_is_endstop_triggered() ? AS5600_ReadAngle() : 0;
}
uint16_t clutch_find_bite_point(uint16_t dis, uint16_t eng) { int32_t r = (int32_t)dis - (int32_t)eng; if (r < 0)r = -r; return (uint16_t)((float)eng + (float)r * 0.7f); }
uint8_t clutch_calibrate(void) {
    if (!AS5600_Init()) return 0;
    uint16_t dis_angle = clutch_find_disengaged(); if (dis_angle == 0) return 0;
    read_clutch_backup_sensor(); uint16_t raw_dis = clutch_backup_sensor_raw;
    clutch_set_direction(1); clutch_set_speed(30);
    uint32_t tout = HAL_GetTick() + 3000; uint16_t last = dis_angle, cur = dis_angle, eng = dis_angle; uint8_t stable = 0;
    while (HAL_GetTick() < tout) {
        cur = AS5600_ReadAngle(); int32_t d = (int32_t)cur - (int32_t)last; if (d < 0)d = -d;
        if (d < 5) { if (++stable >= 5) { eng = cur; break; } }
        else stable = 0;
        last = cur; HAL_Delay(20); IWDG_Refresh();
    }
    clutch_stop(); read_clutch_backup_sensor(); uint16_t raw_eng = clutch_backup_sensor_raw;
    clutch_cal.angle_disengaged = dis_angle; clutch_cal.angle_engaged = eng;
    clutch_cal.angle_bite_point = clutch_find_bite_point(dis_angle, eng);
    clutch_cal.calibrated = 1; calibrate_backup_sensor(raw_dis, raw_eng, dis_angle, eng);
    return 1;
}
uint16_t clutch_get_disengaged_angle(void) { return clutch_cal.angle_disengaged; }
uint16_t clutch_get_engaged_angle(void) { return clutch_cal.angle_engaged; }
uint16_t clutch_get_bite_point(void) { return clutch_cal.angle_bite_point; }

/* Axis calibration helpers */
static uint8_t axis_find_limit(uint8_t axis, uint8_t dir, uint32_t max_steps, uint32_t d_us, volatile uint8_t* flag) {
    uint32_t steps = 0;
    if (axis == 0) stepper_set_direction_x(dir); else stepper_set_direction_y(dir);
    while (*flag == 0 && steps < max_steps && abort_calibration == 0) {
        if (axis == 0) { stepper_step_x(); current_x_steps += (dir == 1) ? 1 : -1; }
        else { stepper_step_y(); current_y_steps += (dir == 1) ? 1 : -1; }
        steps++; if (d_us) sleep_us(d_us); if ((steps & 0xFF) == 0) IWDG_Refresh();
    }
    if (*flag == 1 && abort_calibration == 0) {
        uint8_t bo = (dir == 1) ? 0 : 1;
        if (axis == 0) { stepper_set_direction_x(bo); for (int i = 0; i < BACKOFF_STEPS; i++) { stepper_step_x(); current_x_steps += (bo == 1) ? 1 : -1; sleep_us(d_us); } }
        else { stepper_set_direction_y(bo); for (int i = 0; i < BACKOFF_STEPS; i++) { stepper_step_y(); current_y_steps += (bo == 1) ? 1 : -1; sleep_us(d_us); } }
        return 1;
    }
    return 0;
}
static int32_t axis_measure_backlash(uint8_t axis, uint8_t ret_dir, uint32_t d_us) {
    uint32_t away = 200;
    uint8_t away_dir = (ret_dir == 1) ? 0 : 1;
    if (axis == 0) { stepper_set_direction_x(away_dir); for (uint32_t i = 0; i < away; i++) { stepper_step_x(); current_x_steps += (away_dir == 1) ? 1 : -1; sleep_us(d_us); } }
    else { stepper_set_direction_y(away_dir); for (uint32_t i = 0; i < away; i++) { stepper_step_y(); current_y_steps += (away_dir == 1) ? 1 : -1; sleep_us(d_us); } }
    if (axis == 0) { if (ret_dir == 0) limit_x_left_triggered = 0; else limit_x_right_triggered = 0; }
    else { if (ret_dir == 0) limit_y_front_triggered = 0; else limit_y_back_triggered = 0; }
    uint32_t back = 0;
    volatile uint8_t* flag = (axis == 0) ? ((ret_dir == 0) ? &limit_x_left_triggered : &limit_x_right_triggered) : ((ret_dir == 0) ? &limit_y_front_triggered : &limit_y_back_triggered);
    while (*flag == 0 && back < (away + 100) && abort_calibration == 0) {
        if (axis == 0) { stepper_set_direction_x(ret_dir); stepper_step_x(); current_x_steps += (ret_dir == 1) ? 1 : -1; }
        else { stepper_set_direction_y(ret_dir); stepper_step_y(); current_y_steps += (ret_dir == 1) ? 1 : -1; }
        back++; sleep_us(d_us);
    }
    if (*flag == 1) { int32_t bl = (int32_t)back - (int32_t)away; return (bl < 0) ? 0 : bl; }
    return 0;
}
uint8_t axis_calibrate_x(void) {
    if (cal_in_progress || abort_calibration) return 0;
    cal_in_progress = 1; limit_x_left_triggered = 0; limit_x_right_triggered = 0;
    if (!axis_find_limit(0, 0, MAX_CALIB_STEPS, 800, &limit_x_left_triggered)) { cal_in_progress = 0; return 0; }
    cal_X.left_limit = current_x_steps;
    if (!axis_find_limit(0, 1, MAX_CALIB_STEPS, 800, &limit_x_right_triggered)) { cal_in_progress = 0; return 0; }
    cal_X.right_limit = current_x_steps;
    int32_t total = cal_X.right_limit - cal_X.left_limit; if (total <= 0) { cal_in_progress = 0; return 0; }
    cal_X.home_offset = cal_X.left_limit + (total / 2);
    cal_X.backlash = axis_measure_backlash(0, 0, 1000);
    cal_X.calibrated = 1; cal_in_progress = 0; return 1;
}
uint8_t axis_calibrate_y(void) {
    if (cal_in_progress || abort_calibration) return 0;
    cal_in_progress = 1; limit_y_front_triggered = 0; limit_y_back_triggered = 0;
    if (!axis_find_limit(1, 0, MAX_CALIB_STEPS, 800, &limit_y_front_triggered)) { cal_in_progress = 0; return 0; }
    cal_Y.left_limit = current_y_steps;
    if (!axis_find_limit(1, 1, MAX_CALIB_STEPS, 800, &limit_y_back_triggered)) { cal_in_progress = 0; return 0; }
    cal_Y.right_limit = current_y_steps;
    int32_t total = cal_Y.right_limit - cal_Y.left_limit; if (total <= 0) { cal_in_progress = 0; return 0; }
    cal_Y.home_offset = cal_Y.left_limit + (total / 2);
    cal_Y.backlash = axis_measure_backlash(1, 0, 1000);
    cal_Y.calibrated = 1; cal_in_progress = 0; return 1;
}
void axis_move_relative(uint8_t axis, int32_t steps, uint32_t d_us) {
    if (steps == 0) return;
    uint8_t dir = (steps > 0) ? 1 : 0;
    uint32_t abs_steps = (steps > 0) ? steps : -steps;
    int32_t expected = (axis == 0) ? current_x_steps : current_y_steps;
    expected += (dir == 1) ? abs_steps : -abs_steps;
    if (axis == 0) {
        stepper_set_direction_x(dir); stepper_enable_x();
        for (uint32_t i = 0; i < abs_steps; i++) {
            if ((dir == 1 && limit_x_right_triggered) || (dir == 0 && limit_x_left_triggered)) { uart_send_string("X limit!\r\n"); break; }
            stepper_step_x(); current_x_steps += (dir == 1) ? 1 : -1;
            if (d_us) sleep_us(d_us); if ((i & 0xFF) == 0) IWDG_Refresh();
        }
    }
    else {
        stepper_set_direction_y(dir); stepper_enable_y();
        for (uint32_t i = 0; i < abs_steps; i++) {
            if ((dir == 1 && limit_y_back_triggered) || (dir == 0 && limit_y_front_triggered)) { uart_send_string("Y limit!\r\n"); break; }
            stepper_step_y(); current_y_steps += (dir == 1) ? 1 : -1;
            if (d_us) sleep_us(d_us); if ((i & 0xFF) == 0) IWDG_Refresh();
        }
    }
    int32_t actual = (axis == 0) ? current_x_steps : current_y_steps;
    if (actual != expected) { char m[80]; snprintf(m, sizeof(m), "POS ERROR! Exp %ld got %ld\r\n", (long)expected, (long)actual); uart_send_string(m); log_error(ERR_STEPPER_STALL, 1, (uint16_t)(actual & 0xFFFF)); }
}

/* Flash storage with address range check */
static void flash_unlock(void) { HAL_FLASH_Unlock(); }
static void flash_lock(void) { HAL_FLASH_Lock(); }
static void flash_erase_page(uint32_t addr) {
    if (addr < 0x08000000 || addr > 0x0800FFFF) { uart_send_string("Flash addr out of range!\r\n"); return; }
    FLASH_EraseInitTypeDef e = { 0 }; uint32_t err;
    e.TypeErase = FLASH_TYPEERASE_PAGES; e.Banks = FLASH_BANK_1; e.PageAddress = addr; e.NbPages = 1;
    HAL_FLASHEx_Erase(&e, &err);
}
static uint16_t calculate_crc16(uint8_t* d, uint32_t len) {
    uint16_t crc = 0xFFFF;
    for (uint32_t i = 0; i < len; i++) { crc ^= (uint16_t)d[i]; for (int j = 0; j < 8; j++) { if (crc & 1) crc = (crc >> 1) ^ 0xA001; else crc >>= 1; } }
    return crc;
}
uint8_t flash_save_calibration(CalibrationData* data) {
    if ((uint32_t)data + sizeof(CalibrationData) > 0x08010000) return 0; // beyond 64KB
    uint32_t* src = (uint32_t*)data; uint32_t words = sizeof(CalibrationData) / 4;
    uint32_t addr = CALIB_FLASH_ADDR; flash_unlock(); flash_erase_page(CALIB_FLASH_ADDR);
    for (uint32_t i = 0; i < words; i++) { if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, src[i]) != HAL_OK) { flash_lock(); return 0; } addr += 4; }
    flash_lock(); return 1;
}
uint8_t flash_load_calibration(CalibrationData* data) {
    CalibrationData* flash = (CalibrationData*)CALIB_FLASH_ADDR;
    if (flash->magic != CALIB_MAGIC) return 0;
    memcpy(data, flash, sizeof(CalibrationData));
    uint16_t stored = data->crc; data->crc = 0;
    uint16_t calc = calculate_crc16((uint8_t*)data, sizeof(CalibrationData));
    data->crc = stored; return (stored == calc) && data->calibrated;
}

/* LED patterns */
void led_set_pattern(uint8_t pat) {
    static uint32_t last = 0; static uint8_t cur = 0;
    uint32_t now = HAL_GetTick();
    if (pat == 0) { HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); cur = 0; }
    else if (pat == 1) { HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); cur = 1; }
    else {
        if (cur != pat) { cur = pat; last = now; HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); }
        uint32_t iv = (pat == 2) ? 1000 : (pat == 3) ? 166 : 500;
        if ((now - last) >= iv) { last = now; HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13); }
    }
}

