yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
/* Full calibration state machine (shortened) */
void run_full_calibration(void) {
    if (calibration_running) return;
    calibration_running = 1; calibration_error = 0; calibration_success = 0; abort_calibration = 0; cal_state = CAL_STATE_CLUTCH;
    while (cal_state != CAL_STATE_DONE && cal_state != CAL_STATE_ERROR && abort_calibration == 0) {
        IWDG_Refresh(); led_set_pattern(4);
        switch (cal_state) {
        case CAL_STATE_CLUTCH:
            if (clutch_calibrate()) { cal_data.clutch_disengaged = clutch_get_disengaged_angle(); cal_data.clutch_engaged = clutch_get_engaged_angle(); cal_data.clutch_bite = clutch_get_bite_point(); cal_state = CAL_STATE_AXIS_X; }
            else cal_state = CAL_STATE_ERROR; break;
        case CAL_STATE_AXIS_X:
            if (axis_calibrate_x()) { cal_data.x_left_limit = cal_X.left_limit; cal_data.x_right_limit = cal_X.right_limit; cal_data.x_home = cal_X.home_offset; cal_data.x_backlash = cal_X.backlash; cal_state = CAL_STATE_AXIS_Y; }
            else cal_state = CAL_STATE_ERROR; break;
        case CAL_STATE_AXIS_Y:
            if (axis_calibrate_y()) { cal_data.y_front_limit = cal_Y.left_limit; cal_data.y_back_limit = cal_Y.right_limit; cal_data.y_home = cal_Y.home_offset; cal_data.y_backlash = cal_Y.backlash; cal_state = CAL_STATE_GEAR_POSITIONS; }
            else cal_state = CAL_STATE_ERROR; break;
        case CAL_STATE_GEAR_POSITIONS:
            for (int i = 0; i < 7; i++) { cal_data.gear_positions[i][0] = 0; cal_data.gear_positions[i][1] = 0; }
            cal_state = CAL_STATE_SAVE; break;
        case CAL_STATE_SAVE:
            cal_data.magic = CALIB_MAGIC; cal_data.version = 1; cal_data.calibrated = 0; cal_data.crc = 0;
            cal_data.crc = calculate_crc16((uint8_t*)&cal_data, sizeof(CalibrationData));
            if (flash_save_calibration(&cal_data)) { cal_state = CAL_STATE_DONE; calibration_success = 1; }
            else cal_state = CAL_STATE_ERROR; break;
        default: cal_state = CAL_STATE_ERROR; break;
        }
        HAL_Delay(100);
    }
    calibration_running = 0;
    if (cal_state == CAL_STATE_DONE) led_set_pattern(2);
    else { calibration_error = 1; led_set_pattern(3); stepper_disable_x(); stepper_disable_y(); clutch_stop(); }
}

/* UART and gear learning */
void uart_send_string(char* s) { HAL_UART_Transmit(&huart1, (uint8_t*)s, strlen(s), HAL_MAX_DELAY); }
void uart_clear_buffer(void) { uart_rx_index = 0; uart_cmd_ready = 0; memset(uart_rx_buf, 0, UART_BUF_SIZE); }
void USART1_IRQHandler(void) {
    if (__HAL_UART_GET_FLAG(&huart1, UART_FLAG_RXNE)) {
        uint8_t ch = huart1.Instance->DR;
        if (ch == '\r' || ch == '\n') { if (uart_rx_index > 0) { uart_rx_buf[uart_rx_index] = '\0'; uart_cmd_ready = 1; } else uart_clear_buffer(); }
        else { if (uart_rx_index < UART_BUF_SIZE - 1) uart_rx_buf[uart_rx_index++] = (char)ch; else uart_clear_buffer(); }
        __HAL_UART_CLEAR_FLAG(&huart1, UART_FLAG_RXNE);
    }
}
static void wait_for_enter(const char* p) { uart_send_string((char*)p); uart_clear_buffer(); while (!uart_cmd_ready) { HAL_Delay(50); IWDG_Refresh(); } uart_clear_buffer(); }
static uint8_t learn_one_gear(uint8_t idx) {
    char buf[UART_MSG_BUF_SIZE];
    const char* name = (idx == 0) ? "Neutral (N)" : (idx == 6) ? "Reverse (R)" : gear_names[idx];
    snprintf(buf, sizeof(buf), "\r\n--- TEACHING GEAR: %s ---\r\n", name); uart_send_string(buf);
    wait_for_enter("1. Engine OFF, handbrake ON. Press Enter...");
    snprintf(buf, sizeof(buf), "2. Move lever into '%s'.\r\n", name); uart_send_string(buf);
    wait_for_enter("   Press Enter when lever is in position...");
    stepper_enable_x(); stepper_enable_y(); HAL_Delay(100);
    int32_t x = current_x_steps, y = current_y_steps;
    snprintf(buf, sizeof(buf), "   Recorded: X=%ld Y=%ld\r\n   Save? (y/n): ", x, y); uart_send_string(buf);
    uart_clear_buffer(); while (!uart_cmd_ready) { HAL_Delay(50); IWDG_Refresh(); }
    char resp = uart_rx_buf[0]; uart_clear_buffer();
    if (resp == 'y' || resp == 'Y') { cal_data.gear_positions[idx][0] = x; cal_data.gear_positions[idx][1] = y; uart_send_string("   [OK] Saved.\r\n"); return 1; }
    else { uart_send_string("   [CANCELLED] Retry.\r\n"); return 0; }
}
void learn_gear_positions(void) {
    uart_send_string("\r\n========================================\r\n  GEAR POSITION LEARNING MODE\r\n========================================\r\n");
    stepper_enable_x(); stepper_enable_y();
    for (uint8_t g = 0; g <= 6; g++) while (!learn_one_gear(g)) { uart_send_string("\r\n>>> Retrying...\r\n"); HAL_Delay(1000); }
    uart_send_string("\r\nSaving to Flash...\r\n");
    cal_data.magic = CALIB_MAGIC; cal_data.version = 1; cal_data.calibrated = 1; cal_data.crc = 0;
    cal_data.crc = calculate_crc16((uint8_t*)&cal_data, sizeof(CalibrationData));
    if (flash_save_calibration(&cal_data)) { uart_send_string("=== SUCCESS! All gears saved. ===\r\n"); led_set_pattern(2); }
    else { uart_send_string("=== ERROR! Flash write failed. ===\r\n"); led_set_pattern(3); }
    move_to_neutral();
}

/* Shifting logic (advanced) */
uint16_t get_engine_rpm(void) { return get_rpm_universal(); }
uint8_t get_vehicle_speed(void) { return get_speed_universal(); }
uint8_t is_shift_safe_winter(uint8_t from, uint8_t to) {
    uint16_t rpm = get_engine_rpm(); uint8_t spd = get_vehicle_speed(); DriveParameters p = get_current_drive_params();
    if (rpm > p.max_rpm_shift) { uart_send_string("Shift blocked: RPM limit\r\n"); return 0; }
    if (to == 6 && spd > 5) { uart_send_string("Shift blocked: Reverse at speed\r\n"); return 0; }
    if (current_drive_mode == DRIVE_MODE_WINTER && to == 1 && spd > 10) { uart_send_string("Winter: 1st gear blocked >10km/h\r\n"); return 0; }
    return 1;
}
uint16_t get_adaptive_downshift_hold_time(uint8_t from, uint8_t to) {
    DriveParameters p = get_current_drive_params(); uint16_t base = p.clutch_hold_time_ms;
    if (from > to && to != 0) { uint16_t r = get_engine_rpm(); if (r > 3000) return base + 150; else if (r > 2000) return base + 100; else return base + 50; }
    return base;
}
void clutch_control_advanced(ClutchAction a) {
    DriveParameters p = get_current_drive_params(); uint32_t start; uint16_t hold = get_adaptive_downshift_hold_time(current_gear, current_shift_target_gear);
    switch (a) {
    case CLUTCH_DISENGAGE:
        clutch_set_direction(0); clutch_set_speed(p.clutch_disengage_speed);
        start = HAL_GetTick(); while (!clutch_is_endstop_triggered() && (HAL_GetTick() - start < 1000)) { HAL_Delay(5); IWDG_Refresh(); }
        clutch_stop(); for (uint16_t i = 0; i < hold; i += 50) { HAL_Delay(50); IWDG_Refresh(); } break;
    case CLUTCH_ENGAGE:
        clutch_set_direction(1); clutch_set_speed(p.clutch_engage_speed);
        if (!p.use_bite_point) {
            start = HAL_GetTick(); while (clutch_get_current_angle() < cal_data.clutch_engaged && (HAL_GetTick() - start < 1000)) { HAL_Delay(5); IWDG_Refresh(); }
        }
        else {
            start = HAL_GetTick(); while (clutch_get_current_angle() < cal_data.clutch_bite && (HAL_GetTick() - start < 1000)) { HAL_Delay(5); IWDG_Refresh(); }
            clutch_stop(); HAL_Delay(300);
            clutch_set_direction(1); clutch_set_speed(20);
            start = HAL_GetTick(); while (clutch_get_current_angle() < cal_data.clutch_engaged && (HAL_GetTick() - start < 1000)) { HAL_Delay(5); IWDG_Refresh(); }
        }
        clutch_stop(); break;
    case CLUTCH_TO_BITE:
        clutch_set_direction(1); clutch_set_speed(p.use_bite_point ? 20 : 60);
        while (clutch_get_current_angle() < cal_data.clutch_bite) { HAL_Delay(5); IWDG_Refresh(); }
        clutch_stop(); break;
    }
}
void move_to_gear_position_advanced(uint8_t gear, uint8_t axis) {
    DriveParameters p = get_current_drive_params(); uint32_t d = p.shift_delay_us;
    int32_t target = (axis == 0) ? cal_data.gear_positions[gear][0] : cal_data.gear_positions[gear][1];
    if (target == 0 && gear != 0) { uart_send_string("ERROR: Gear not learned\r\n"); return; }
    int32_t cur = (axis == 0) ? current_x_steps : current_y_steps;
    int32_t bl = (axis == 0) ? cal_data.x_backlash : cal_data.y_backlash;
    int32_t diff = target - cur; if (diff == 0) return;
    uint8_t dir = (diff > 0) ? 1 : 0; int32_t abs_diff = (diff > 0) ? diff : -diff;
    if (axis == 0) {
        if (dir == 1) { if (cur > target) axis_move_relative(0, -(abs_diff + bl), d); axis_move_relative(0, abs_diff + bl, d); }
        else { if (cur < target) axis_move_relative(0, (abs_diff + bl), d); axis_move_relative(0, -(abs_diff + bl), d); }
    }
    else {
        if (dir == 1) { if (cur > target) axis_move_relative(1, -(abs_diff + bl), d); axis_move_relative(1, abs_diff + bl, d); }
        else { if (cur < target) axis_move_relative(1, (abs_diff + bl), d); axis_move_relative(1, -(abs_diff + bl), d); }
    }
}
void move_to_neutral(void) { move_to_gear_position_advanced(0, 1); HAL_Delay(30); move_to_gear_position_advanced(0, 0); HAL_Delay(30); }
uint8_t shift_gear_advanced(uint8_t t) {
    if (shifting_in_progress) return 0; if (t == current_gear) return 1; if (!is_shift_safe_winter(current_gear, t)) return 0;
    shifting_in_progress = 1; current_shift_target_gear = t; activity_reset_timer();
    char msg[64]; snprintf(msg, sizeof(msg), "Shifting to gear %d...\r\n", t); uart_send_string(msg);
    clutch_control_advanced(CLUTCH_DISENGAGE);
    if (current_gear != 0) { move_to_neutral(); HAL_Delay(50); }
    if (t != 0) { move_to_gear_position_advanced(t, 0); HAL_Delay(40); move_to_gear_position_advanced(t, 1); HAL_Delay(80); }
    if (t == 0) clutch_control_advanced(CLUTCH_ENGAGE);
    else {
        if (current_gear == 0 && get_vehicle_speed() < 3) { clutch_control_advanced(CLUTCH_TO_BITE); HAL_Delay(400); clutch_control_advanced(CLUTCH_ENGAGE); }
        else clutch_control_advanced(CLUTCH_ENGAGE);
    }
    current_gear = t; shifting_in_progress = 0; current_shift_target_gear = 0;
    snprintf(msg, sizeof(msg), "Shift complete. Gear: %d\r\n", current_gear); uart_send_string(msg);
    return 1;
}
uint8_t shift_gear_limp_safe(uint8_t t) {
    if (!limp_mode_active) return shift_gear_advanced(t);
    if (t == 0 || t == 2 || t == current_gear) { uart_send_string("[LIMP] Allowed shift.\r\n"); return shift_gear_advanced(t); }
    char msg[128]; snprintf(msg, sizeof(msg), "LIMP: Shift to %d BLOCKED. Use N or 2nd.\r\n", t);
    uart_send_string(msg); bt_send_string(msg); return 0;
}

/* Current monitoring and safety */
static uint16_t read_adc_channel(uint32_t ch) {
    ADC_ChannelConfTypeDef c = { 0 }; c.Channel = ch; c.Rank = 1; c.SamplingTime = ADC_SAMPLETIME_13CYCLES_5;
    HAL_ADC_ConfigChannel(&hadc1, &c); HAL_ADC_Start(&hadc1); HAL_ADC_PollForConversion(&hadc1, 10);
    uint16_t v = HAL_ADC_GetValue(&hadc1); HAL_ADC_Stop(&hadc1); return v;
}
void calibrate_current_offsets(void) {
    uint32_t sx = 0, sy = 0, sc = 0;
    for (int i = 0; i < 16; i++) { sx += read_adc_channel(ADC_CHANNEL_10); sy += read_adc_channel(ADC_CHANNEL_11); sc += read_adc_channel(ADC_CHANNEL_12); HAL_Delay(2); }
    current_offsets[0] = sx / 16; current_offsets[1] = sy / 16; current_offsets[2] = sc / 16;
}
float get_current(uint8_t idx) {
    if (idx > 2) return 0.0f;
    uint32_t ch[] = { ADC_CHANNEL_10,ADC_CHANNEL_11,ADC_CHANNEL_12 };
    uint16_t raw = read_adc_channel(ch[idx]); int16_t diff = (int16_t)raw - current_offsets[idx];
    float volts = diff * (3.3f / 4096.0f); float amps = volts / 0.185f; return (amps > 0) ? amps : -amps;
}
void current_monitor_task(void) {
    static uint32_t last = 0; if (HAL_GetTick() - last < 100) return; last = HAL_GetTick();
    float ix = get_current(0), iy = get_current(1), ic = get_current(2);
    if (ix > 4.5f && !shifting_in_progress && !calibration_running) { log_error(ERR_CURRENT_OVER_X, 1, (uint16_t)(ix * 10)); stepper_disable_x(); }
    if (iy > 4.5f && !shifting_in_progress && !calibration_running) { log_error(ERR_CURRENT_OVER_Y, 1, (uint16_t)(iy * 10)); stepper_disable_y(); }
    if (ic > 10.0f) { log_error(ERR_CURRENT_OVER_CLUTCH, 2, (uint16_t)(ic * 10)); emergency_power_off(); }
}
void emergency_power_off(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET); uart_send_string("EMERGENCY POWER OFF\r\n"); }
void emergency_power_on(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET); }
void emergency_stop(void) { log_error(ERR_EMERGENCY_BUTTON, 2, 0); emergency_power_off(); shifting_in_progress = 0; calibration_running = 0; limp_mode_active = 1; clutch_stop(); stepper_disable_x(); stepper_disable_y(); }
void log_error(uint8_t code, uint8_t sev, uint16_t data) {
    error_buffer[error_index].timestamp = HAL_GetTick(); error_buffer[error_index].error_code = code; error_buffer[error_index].severity = sev; error_buffer[error_index].data = data;
    error_index = (error_index + 1) % ERROR_LOG_MAX_ENTRIES; if (error_count < ERROR_LOG_MAX_ENTRIES) error_count++;
    if (sev == 2) { limp_mode_active = 1; emergency_power_off(); shifting_in_progress = 0; calibration_running = 0; clutch_stop(); stepper_disable_x(); stepper_disable_y(); led_set_pattern(3); bt_send_string("CRITICAL FAULT! Limp mode.\r\n"); }
}
void save_error_log_to_flash(void) {
    if (error_count == 0) return; flash_unlock(); flash_erase_page(ERROR_LOG_ADDR);
    uint32_t addr = ERROR_LOG_ADDR; for (int i = 0; i < error_count; i++) { HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, *((uint32_t*)&error_buffer[i])); addr += 4; HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, *(((uint32_t*)&error_buffer[i]) + 1)); addr += 4; }
    flash_lock();
}
uint8_t diagnostic_check(void) {
    uint8_t ok = 1; if (!AS5600_Init()) { log_error(ERR_AS5600_MISSING, 2, 0); ok = 0; }
    if (limit_x_left_triggered && limit_x_right_triggered) { log_error(ERR_LIMIT_SWITCH_STUCK, 1, 0); ok = 0; }
    if (limit_y_front_triggered && limit_y_back_triggered) { log_error(ERR_LIMIT_SWITCH_STUCK, 1, 1); ok = 0; }
    return ok;
}
void HAL_GPIO_EXTI_Callback(uint16_t pin) {
    switch (pin) {
    case GPIO_PIN_1: clutch_endstop_triggered = 1; break;
    case GPIO_PIN_2: limit_x_left_triggered = 1; break;
    case GPIO_PIN_3: limit_x_right_triggered = 1; break;
    case GPIO_PIN_10: limit_y_front_triggered = 1; break;
    case GPIO_PIN_11: limit_y_back_triggered = 1; break;
    case GPIO_PIN_8: emergency_stop(); break;
    default: break;
    }
}
void safety_init(void) {
    GPIO_InitTypeDef g = { 0 }; __HAL_RCC_GPIOA_CLK_ENABLE(); g.Pin = GPIO_PIN_8; g.Mode = GPIO_MODE_OUTPUT_PP; g.Speed = GPIO_SPEED_FREQ_LOW; HAL_GPIO_Init(GPIOA, &g);
    emergency_power_on(); stepper_disable_x(); stepper_disable_y(); clutch_stop(); calibrate_current_offsets(); diagnostic_check();
}

