yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
/* CAN and auto/manual shifting */
void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef* hcan) {
    CAN_RxHeaderTypeDef hdr; uint8_t data[8];
    if (HAL_CAN_GetRxMessage(hcan, CAN_RX_FIFO0, &hdr, data) == HAL_OK) {
        switch (hdr.StdId) {
        case 0x0C: engine_rpm = ((uint16_t)data[0] << 8) | data[1]; break;
        case 0x0D: vehicle_speed_kmh = data[0]; break;
        case 0x11: throttle_percent = data[0]; break;
        case 0x1A: brake_pressed = (data[0] > 0) ? 1 : 0; break;
        case 0x30: shift_paddle_up = (data[0] & 0x01); shift_paddle_down = (data[0] & 0x02); break;
        default: break;
        }
        /* Extended AWD wheel speeds – if IDs are set in profile */
        if (current_profile.front_speed_id != 0 && hdr.StdId == current_profile.front_speed_id) {
            uint16_t val = 0; for (int i = 0; i < current_profile.front_speed_length; i++) val |= (data[current_profile.front_speed_offset + i] << (8 * i));
            front_wheel_speed_raw = val;
        }
        if (current_profile.rear_speed_id != 0 && hdr.StdId == current_profile.rear_speed_id) {
            uint16_t val = 0; for (int i = 0; i < current_profile.rear_speed_length; i++) val |= (data[current_profile.rear_speed_offset + i] << (8 * i));
            rear_wheel_speed_raw = val;
        }
    }
}
void filter_data(void) { filtered_rpm = (uint16_t)((1.0f - FILTER_ALPHA) * filtered_rpm + FILTER_ALPHA * engine_rpm); filtered_throttle = (uint8_t)((1.0f - FILTER_ALPHA) * filtered_throttle + FILTER_ALPHA * throttle_percent); }
void auto_shift_task(void) {
    if (limp_mode_active || shifting_in_progress || current_gear == 0 || current_gear == 6) return;
    static uint32_t last = 0; uint32_t now = HAL_GetTick(); if (now - last < 800) return;
    const ShiftMapEntry* e = &shift_map[SHIFT_MAP_SIZE - 1];
    for (int i = 0; i < SHIFT_MAP_SIZE; i++) if (filtered_throttle <= shift_map[i].throttle) { e = &shift_map[i]; break; }
    if (filtered_rpm > e->upshift_rpm && current_gear < 5) { shift_gear_limp_safe(current_gear + 1); last = now; }
    else if (filtered_rpm < e->downshift_rpm && current_gear>1) { shift_gear_limp_safe(current_gear - 1); last = now; }
    if (brake_pressed && filtered_rpm < 2000 && current_gear>1 && (now - last) > 500) { shift_gear_limp_safe(current_gear - 1); last = now; }
}
void manual_shift_task(void) {
    static uint32_t last = 0; uint32_t now = HAL_GetTick(); if (now - last < 150) return;
    if (shift_paddle_up) { if (current_gear < 5) shift_gear_limp_safe(current_gear + 1); last = now; shift_paddle_up = 0; }
    else if (shift_paddle_down) { if (current_gear > 1) shift_gear_limp_safe(current_gear - 1); last = now; shift_paddle_down = 0; }
}
void toggle_drive_mode(void) {
    if (current_drive_mode == DRIVE_MODE_NORMAL) { current_drive_mode = DRIVE_MODE_COMFORT; uart_send_string(">>> AUTO (Comfort) <<<\r\n"); led_set_pattern(2); }
    else { current_drive_mode = DRIVE_MODE_NORMAL; uart_send_string(">>> MANUAL (Normal) <<<\r\n"); led_set_pattern(0); }
    activity_reset_timer();
}
void set_drive_mode_by_name(const char* s) {
    if (strcmp(s, "auto") == 0 || strcmp(s, "1") == 0) { current_drive_mode = DRIVE_MODE_COMFORT; uart_send_string(">>> AUTO (Comfort) ENABLED <<<\r\n"); led_set_pattern(2); }
    else if (strcmp(s, "manual") == 0 || strcmp(s, "0") == 0) { current_drive_mode = DRIVE_MODE_NORMAL; uart_send_string(">>> MANUAL (Normal) ENABLED <<<\r\n"); led_set_pattern(0); }
    else uart_send_string("Invalid mode. Use 'auto' or 'manual'.\r\n");
    activity_reset_timer();
}

/* Bluetooth communication */
void bt_send_string(char* s) { HAL_UART_Transmit(&huart3, (uint8_t*)s, strlen(s), HAL_MAX_DELAY); }
void send_status_via_bt(void) {
    char b[UART_MSG_BUF_SIZE];
    const char* g = (current_gear == 0) ? "N" : (current_gear == 6) ? "R" : gear_names[current_gear];
    const char* m = (current_drive_mode != DRIVE_MODE_NORMAL) ? "AUTO" : "MANUAL";
    snprintf(b, sizeof(b), "Gear:%s RPM:%d Spd:%d Throt:%d%% Mode:%s Limp:%s\r\n", g, filtered_rpm, get_speed_universal(), filtered_throttle, m, limp_mode_active ? "ON" : "OFF");
    bt_send_string(b);
}
void USART3_IRQHandler(void) {
    if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_RXNE)) {
        uint8_t ch = huart3.Instance->DR;
        if (ch == '\r' || ch == '\n') { if (bt_index > 0) { bt_buffer[bt_index] = '\0'; bt_cmd_ready = 1; } bt_index = 0; }
        else { if (bt_index < BT_BUF_SIZE - 1) bt_buffer[bt_index++] = (char)ch; else bt_index = 0; }
        __HAL_UART_CLEAR_FLAG(&huart3, UART_FLAG_RXNE);
    }
}
void process_bt_command(void) {
    if (!bt_cmd_ready) return; activity_reset_timer();
    char c = bt_buffer[0]; uint8_t can = cal_data.calibrated && !shifting_in_progress && !calibration_running;
    switch (c) {
    case '1': case '2': case '3': case '4': case '5': if (can) shift_gear_limp_safe(c - '0'); else bt_send_string("Shift blocked\r\n"); break;
    case 'N': case 'n': if (can) shift_gear_limp_safe(0); else bt_send_string("Shift blocked\r\n"); break;
    case 'R': case 'r': if (can) shift_gear_limp_safe(6); else bt_send_string("Shift blocked\r\n"); break;
    case 'A': case 'a': current_drive_mode = DRIVE_MODE_COMFORT; bt_send_string("Mode: AUTO\r\n"); led_set_pattern(2); break;
    case 'M': case 'm': current_drive_mode = DRIVE_MODE_NORMAL; bt_send_string("Mode: MANUAL\r\n"); led_set_pattern(0); break;
    case 'S': case 's': send_status_via_bt(); break;
    default: bt_send_string("Cmds: 1-5,N,R,A,M,S\r\n"); break;
    }
    bt_index = 0; bt_cmd_ready = 0; memset(bt_buffer, 0, BT_BUF_SIZE);
}

/* UART command handler (simplified) */
void uart_command_handler(char* cmd) {
    activity_reset_timer();
    if (strcmp(cmd, "help") == 0) {
        uart_send_string("\r\n=== COMMANDS ===\r\nstatus calibrate learn_gears mode auto/manual gear N/1-5/R\ncan_scan can_status fault can clear fault save reset sensor_status\n");
#ifdef USE_SD_CARD
        uart_send_string("sd_save sd_load\n");
#endif
        uart_send_string("================\r\n");
    }
    else if (strcmp(cmd, "status") == 0) {
        char b[UART_MSG_BUF_SIZE];
        uart_send_string("\r\n--- STATUS ---\r\n");
        snprintf(b, sizeof(b), "Mode:%s Gear:%s\r\n", (current_drive_mode != DRIVE_MODE_NORMAL) ? "AUTO" : "MANUAL", (current_gear == 0) ? "N" : (current_gear == 6) ? "R" : gear_names[current_gear]); uart_send_string(b);
        snprintf(b, sizeof(b), "RPM:%d Speed:%d Throttle:%d%%\r\n", filtered_rpm, get_speed_universal(), filtered_throttle); uart_send_string(b);
        snprintf(b, sizeof(b), "Clutch angle:%d (dis:%d bite:%d eng:%d)\r\n", clutch_get_current_angle(), cal_data.clutch_disengaged, cal_data.clutch_bite, cal_data.clutch_engaged); uart_send_string(b);
        snprintf(b, sizeof(b), "Sensor:%s Backup raw:%d\r\n", (active_sensor == PRIMARY_AS5600) ? "AS5600" : "POT", clutch_backup_sensor_raw); uart_send_string(b);
        snprintf(b, sizeof(b), "Calibrated:%s Limp:%s Sleep:%s\r\n", cal_data.calibrated ? "YES" : "NO", limp_mode_active ? "ACTIVE" : "OFF", system_sleeping ? "YES" : "NO"); uart_send_string(b);
    }
    else if (strcmp(cmd, "calibrate") == 0) { if (calibration_running || shifting_in_progress) uart_send_string("Busy!\r\n"); else { uart_send_string("Starting calibration...\r\n"); run_full_calibration(); } }
    else if (strcmp(cmd, "learn_gears") == 0) { if (calibration_running || shifting_in_progress || !cal_data.calibrated) uart_send_string("Complete basic calibration first!\r\n"); else learn_gear_positions(); }
    else if (strncmp(cmd, "mode ", 5) == 0) set_drive_mode_by_name(cmd + 5);
    else if (strncmp(cmd, "gear ", 5) == 0) {
        if (calibration_running || !cal_data.calibrated) { uart_send_string("Not calibrated!\r\n"); return; }
        char gc = cmd[5]; uint8_t t = 0;
        if (gc == 'N' || gc == 'n' || gc == '0') t = 0; else if (gc >= '1' && gc <= '5') t = gc - '0'; else if (gc == 'R' || gc == 'r' || gc == '6') t = 6; else { uart_send_string("Invalid gear\r\n"); return; }
        if (!shift_gear_limp_safe(t)) uart_send_string("Shift blocked\r\n");
    }
    else if (strcmp(cmd, "can_scan") == 0) { can_profile_valid = 0; if (auto_scan_can()) apply_vehicle_adaptation(); }
    else if (strcmp(cmd, "can_status") == 0) { char b[UART_MSG_BUF_SIZE]; snprintf(b, sizeof(b), "CAN valid:%s RPM_ID:0x%X SPD_ID:0x%X\r\n", can_profile_valid ? "YES" : "NO", current_profile.rpm_id, current_profile.speed_id); uart_send_string(b); }
    else if (strcmp(cmd, "fault can") == 0) enter_limp_mode("SIMULATED CAN LOSS");
    else if (strcmp(cmd, "clear fault") == 0) exit_limp_mode();
    else if (strcmp(cmd, "save") == 0) { cal_data.crc = 0; cal_data.crc = calculate_crc16((uint8_t*)&cal_data, sizeof(CalibrationData)); if (flash_save_calibration(&cal_data)) uart_send_string("Saved to Flash.\r\n"); else uart_send_string("Flash write failed.\r\n"); }
#ifdef USE_SD_CARD
    else if (strcmp(cmd, "sd_save") == 0) { if (sd_save_calibration(&cal_data)) uart_send_string("Saved to SD.\r\n"); else uart_send_string("SD write failed.\r\n"); }
    else if (strcmp(cmd, "sd_load") == 0) { if (sd_load_calibration(&cal_data)) uart_send_string("Loaded from SD.\r\n"); else uart_send_string("SD load failed.\r\n"); }
#endif
    else if (strcmp(cmd, "sensor_status") == 0) { char b[UART_MSG_BUF_SIZE]; snprintf(b, sizeof(b), "Active:%s AS5600:%d Backup raw:%d Mapped:%d\r\n", (active_sensor == PRIMARY_AS5600) ? "AS5600" : "POT", AS5600_ReadAngle(), clutch_backup_sensor_raw, backup_to_as5600_angle(clutch_backup_sensor_raw)); uart_send_string(b); }
    else if (strcmp(cmd, "reset") == 0) { uart_send_string("Resetting...\r\n"); HAL_Delay(500); NVIC_SystemReset(); }
    else uart_send_string("Unknown. Type 'help'.\r\n");
}

/* Main loop */
void main_loop(void) {
    static uint32_t t100 = 0, t500 = 0, t1000 = 0;
    uint32_t now = HAL_GetTick();
    if (now - t100 >= 100) {
        t100 = now; filter_data(); current_monitor_task(); check_critical_failures(); parking_monitor_task(); awd_auto_task();
        if (cal_data.calibrated && !calibration_running) { if (current_drive_mode != DRIVE_MODE_NORMAL) auto_shift_task(); else manual_shift_task(); }
        process_bt_command();
    }
    if (now - t500 >= 500) {
        t500 = now; IWDG_Refresh();
        if (cal_data.calibrated && !calibration_running) { diagnostic_check(); read_clutch_backup_sensor(); check_sensor_consistency(); }
    }
    if (now - t1000 >= 1000) {
        t1000 = now; idle_monitor_task();
        if (!calibration_running && !shifting_in_progress) {
            if (!cal_data.calibrated) led_set_pattern(1);
            else if (system_sleeping) led_set_pattern(4);
            else if (current_drive_mode != DRIVE_MODE_NORMAL) led_set_pattern(2);
            else led_set_pattern(0);
        }
    }
    if (uart_cmd_ready) { uart_command_handler(uart_rx_buf); uart_clear_buffer(); }
}

/* Main function */
int main(void) {
    HAL_Init(); SystemClock_Config();
    MX_GPIO_Init(); MX_I2C1_Init(); MX_SPI2_Init(); MX_USART1_UART_Init(); MX_USART3_UART_Init(); MX_CAN1_Init(); MX_ADC1_Init(); MX_TIM2_Init(); MX_TIM4_Init();
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
    DWT_Init(); safety_init();
    for (int i = 0; i < 3; i++) { HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); HAL_Delay(100); HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); HAL_Delay(100); }
    uart_send_string("\r\n=== ROBOTIZED GEARBOX v1.3 ===\r\n");
    load_can_profile(); apply_vehicle_adaptation();
    if (flash_load_calibration(&cal_data)) { uart_send_string("Calibration loaded.\r\n"); led_set_pattern(cal_data.calibrated ? (current_drive_mode != DRIVE_MODE_NORMAL ? 2 : 0) : 1); }
    else { uart_send_string("No calibration. Auto-cal in 5 sec...\r\n"); auto_calib_timer = HAL_GetTick() + 5000; }
    while (1) {
        if (auto_calib_timer && HAL_GetTick() >= auto_calib_timer) {
            if (!uart_cmd_ready) { auto_calib_timer = 0; run_full_calibration(); }
            else { uart_send_string("Auto-cal cancelled.\r\n"); auto_calib_timer = 0; uart_clear_buffer(); }
        }
        main_loop();
        HAL_Delay(1);
    }
}

/* SD Card (conditional) */
#ifdef USE_SD_CARD
#include "ff.h"
#include "diskio.h"
FATFS fatfs; FIL calib_file; FRESULT fresult;
static uint8_t sd_mount_and_open(void) { if (f_mount(&fatfs, "0:", 1) != FR_OK) return 0; if (f_open(&calib_file, "0:/calib.bin", FA_READ | FA_WRITE | FA_OPEN_ALWAYS) != FR_OK) { f_mount(NULL, "0:", 1); return 0; } return 1; }
static void sd_close_and_unmount(void) { f_close(&calib_file); f_mount(NULL, "0:", 1); }
uint8_t sd_save_calibration(const CalibrationData* data) { UINT bw; if (!sd_mount_and_open()) return 0; f_lseek(&calib_file, 0); if (f_write(&calib_file, data, sizeof(CalibrationData), &bw) == FR_OK && bw == sizeof(CalibrationData)) { f_sync(&calib_file); sd_close_and_unmount(); return 1; } sd_close_and_unmount(); return 0; }
uint8_t sd_load_calibration(CalibrationData* data) { UINT br; CalibrationData tmp; if (!sd_mount_and_open()) return 0; f_lseek(&calib_file, 0); if (f_read(&calib_file, &tmp, sizeof(CalibrationData), &br) != FR_OK || br != sizeof(CalibrationData)) { sd_close_and_unmount(); return 0; } sd_close_and_unmount(); if (tmp.magic != CALIB_MAGIC) return 0; uint16_t stored = tmp.crc; tmp.crc = 0; if (stored != calculate_crc16((uint8_t*)&tmp, sizeof(CalibrationData))) return 0; memcpy(data, &tmp, sizeof(CalibrationData)); return 1; }
#endif

/* Redundant clutch sensor and advanced features (Stages 13-19) */
void read_clutch_backup_sensor(void) {
    ADC_ChannelConfTypeDef c = { 0 }; c.Channel = ADC_CHANNEL_14; c.Rank = 1; c.SamplingTime = ADC_SAMPLETIME_13CYCLES_5;
    HAL_ADC_ConfigChannel(&hadc1, &c); HAL_ADC_Start(&hadc1); if (HAL_ADC_PollForConversion(&hadc1, 10) == HAL_OK) clutch_backup_sensor_raw = HAL_ADC_GetValue(&hadc1); HAL_ADC_Stop(&hadc1);
}
void calibrate_backup_sensor(uint16_t rd, uint16_t re, uint16_t ad, uint16_t ae) {
    backup_cal.raw_min = rd; backup_cal.raw_max = re;
    int32_t as5600_range = (int32_t)ad - (int32_t)ae; int32_t backup_range = (int32_t)backup_cal.raw_max - (int32_t)backup_cal.raw_min;
    backup_cal.scale = (backup_range != 0) ? (float)as5600_range / (float)backup_range : 1.0f; backup_cal.calibrated = 1;
}
uint16_t backup_to_as5600_angle(uint16_t raw) {
    if (!backup_cal.calibrated) return 0;
    if (raw < backup_cal.raw_min) raw = backup_cal.raw_min; if (raw > backup_cal.raw_max) raw = backup_cal.raw_max;
    int32_t off = (int32_t)raw - backup_cal.raw_min; float ang = (float)off * backup_cal.scale;
    uint16_t res = (uint16_t)(cal_data.clutch_engaged + ang + 0.5f); if (res > 4095) res = 4095; return res;
}
void check_sensor_consistency(void) {
    if (!backup_cal.calibrated) return;
    uint16_t prim = AS5600_ReadAngle(); uint16_t back = backup_to_as5600_angle(clutch_backup_sensor_raw);
    int16_t diff = (int16_t)prim - (int16_t)back; if (diff < 0) diff = -diff;
    if (diff > SENSOR_TOLERANCE) {
        if (active_sensor == PRIMARY_AS5600 && !as5600_fault) { as5600_fault = 1; active_sensor = BACKUP_POTENTIOMETER; log_error(ERR_AS5600_MISSING, 1, diff); uart_send_string("Sensor mismatch! Using backup.\r\n"); bt_send_string("AS5600 FAULT - Backup active\r\n"); }
    }
    else {
        if (as5600_fault && active_sensor == BACKUP_POTENTIOMETER) { static uint8_t stable = 0; if (diff < (SENSOR_TOLERANCE / 2)) { if (++stable >= 5) { as5600_fault = 0; active_sensor = PRIMARY_AS5600; stable = 0; uart_send_string("AS5600 recovered.\r\n"); } } else stable = 0; }
    }
}
uint16_t clutch_get_current_angle(void) {
    if (active_sensor == PRIMARY_AS5600) { uint16_t a = AS5600_ReadAngle(); if (!as5600_comm_ok) { active_sensor = BACKUP_POTENTIOMETER; log_error(ERR_AS5600_MISSING, 1, 0); } return a; }
    else if (active_sensor == BACKUP_POTENTIOMETER) return backup_to_as5600_angle(clutch_backup_sensor_raw);
    return 0xFFFF;
}

/* Power management */
void power_clutch_on(void) { clutch_stop(); } void power_clutch_off(void) { clutch_stop(); }
static void power_actuators_on(void) { stepper_enable_x(); stepper_enable_y(); power_clutch_on(); }
static void power_actuators_off(void) { /* steppers stay enabled to hold gear */ power_clutch_off(); }
void activity_reset_timer(void) { if (system_sleeping) { system_sleeping = 0; power_actuators_on(); uart_send_string("[INFO] Woke up.\r\n"); } last_activity_time = HAL_GetTick(); }
static void system_enter_sleep(void) { if (shifting_in_progress || calibration_running || limp_mode_active) return; if (system_sleeping) return; power_actuators_off(); system_sleeping = 1; led_set_pattern(4); HAL_SuspendTick(); HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI); HAL_ResumeTick(); uart_send_string("[INFO] Sleep mode.\r\n"); }
void idle_monitor_task(void) { static uint32_t last = 0; uint32_t now = HAL_GetTick(); if (now - last < 1000) return; last = now; if (!system_sleeping && !shifting_in_progress && !calibration_running && (now - last_activity_time) >= IDLE_TIMEOUT_MS) system_enter_sleep(); }

