yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
/* Advanced vehicle logic (CAN profiling, AWD, parking, limp) */
uint16_t get_rpm_universal(void) { if (can_profile_valid && current_profile.rpm_id != 0) return filtered_rpm; read_analog_tacho(); return engine_rpm_analog; }
uint8_t get_speed_universal(void) { return (can_profile_valid && current_profile.speed_id != 0) ? vehicle_speed_kmh : 0; }
uint8_t auto_scan_can(void) {
    uart_send_string("Scanning CAN (4 sec)...\r\n");
    typedef struct { uint16_t id; uint8_t cnt; } Seen; Seen seen[64]; uint8_t seen_cnt = 0;
    uint32_t start = HAL_GetTick();
    while (HAL_GetTick() - start < 4000) {
        if (HAL_CAN_GetRxFifoFillLevel(&hcan1, CAN_RX_FIFO0) > 0) { CAN_RxHeaderTypeDef hdr; uint8_t d[8]; if (HAL_CAN_GetRxMessage(&hcan1, CAN_RX_FIFO0, &hdr, d) == HAL_OK) { uint8_t f = 0; for (int i = 0; i < seen_cnt; i++) if (seen[i].id == hdr.StdId) { seen[i].cnt++; f = 1; break; } if (!f && seen_cnt < 64) { seen[seen_cnt].id = hdr.StdId; seen[seen_cnt].cnt = 1; seen_cnt++; } } }
        IWDG_Refresh(); HAL_Delay(5);
    }
    int best_score = 0, best_idx = -1;
    for (int p = 0; p < NUM_PROFILES; p++) {
        int score = 0;
        for (int i = 0; i < seen_cnt; i++) { if (seen[i].cnt < 2) continue; if (seen[i].id == known_profiles[p].rpm_id) score += 3; if (seen[i].id == known_profiles[p].speed_id) score += 3; if (seen[i].id == known_profiles[p].throttle_id) score += 1; if (seen[i].id == known_profiles[p].brake_id) score += 1; }
        if (score > best_score) { best_score = score; best_idx = p; }
    }
    if (best_score >= 5 && best_idx >= 0) { current_profile = known_profiles[best_idx]; can_profile_valid = 1; save_can_profile(); uart_send_string("Profile matched.\r\n"); return 1; }
    uart_send_string("No match. Using analog fallback.\r\n"); return 0;
}
void save_can_profile(void) { flash_unlock(); flash_erase_page(CAN_PROFILE_FLASH_ADDR); uint32_t* src = (uint32_t*)&current_profile; uint32_t words = sizeof(CanProfile) / 4, addr = CAN_PROFILE_FLASH_ADDR; for (uint32_t i = 0; i < words; i++) { HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, src[i]); addr += 4; } flash_lock(); }
void load_can_profile(void) { CanProfile* fp = (CanProfile*)CAN_PROFILE_FLASH_ADDR; if (fp->rpm_id != 0) { memcpy(&current_profile, fp, sizeof(CanProfile)); can_profile_valid = 1; uart_send_string("CAN profile loaded.\r\n"); } else { uart_send_string("No profile. Scanning...\r\n"); auto_scan_can(); } }
void apply_vehicle_adaptation(void) { if (!can_profile_valid) return; uart_send_string("Applying adaptations...\r\n"); if (current_profile.rpm_id == 0x0C) uart_send_string("Ford profile.\r\n"); else if (current_profile.rpm_id == 0x280) uart_send_string("VAG profile.\r\n"); }
DriveParameters get_current_drive_params(void) { return params_table[current_drive_mode]; }
void set_drive_mode(DriveMode m) { if (m == current_drive_mode || shifting_in_progress) return; current_drive_mode = m; const char* n[] = { "COMFORT","NORMAL","SPORT","WINTER" }; char msg[64]; snprintf(msg, sizeof(msg), ">>> DRIVE MODE: %s <<<\r\n", n[m]); uart_send_string(msg); bt_send_string(msg); activity_reset_timer(); }
uint8_t get_start_gear(void) { return get_current_drive_params().start_from_second ? 2 : 1; }
void start_moving(void) { activity_reset_timer(); uint8_t t = get_start_gear(); if (current_gear != 0) shift_gear_limp_safe(0); HAL_Delay(100); if (get_speed_universal() < 5) shift_gear_limp_safe(t); else uart_send_string("Start blocked: speed high.\r\n"); }
void check_critical_failures(void) { if (limp_mode_active) return; uint16_t r = get_rpm_universal(); uint8_t s = get_speed_universal(); if (r == 0 && s > 5) { if (can_loss_timer == 0) can_loss_timer = HAL_GetTick(); else if ((HAL_GetTick() - can_loss_timer) > 2000) enter_limp_mode("CAN BUS LOST"); } else can_loss_timer = 0; if (active_sensor == SENSOR_FAULT) enter_limp_mode("CLUTCH SENSOR FAULT"); }
void enter_limp_mode(const char* reason) { limp_mode_active = 1; current_drive_mode = DRIVE_MODE_NORMAL; char m[128]; snprintf(m, sizeof(m), "LIMP MODE! Reason: %s\r\nUse N or 2nd gear.\r\n", reason); bt_send_string(m); uart_send_string(m); log_error(ERR_WATCHDOG_RESET, 2, 99); led_set_pattern(3); }
void exit_limp_mode(void) { if (!limp_mode_active) return; if (active_sensor != SENSOR_FAULT && get_rpm_universal() > 0) { limp_mode_active = 0; can_loss_timer = 0; uart_send_string("Limp mode cleared.\r\n"); bt_send_string("Limp mode cleared.\r\n"); led_set_pattern(current_drive_mode != DRIVE_MODE_NORMAL ? 2 : 0); } else uart_send_string("Fault still present.\r\n"); }
void execute_parking_mode(void) { if (is_parked || get_speed_universal() > 2) return; uart_send_string(">>> PARKING MODE <<<\r\n"); activity_reset_timer(); if (current_gear == 0) { shift_gear_limp_safe(1); HAL_Delay(500); } clutch_control_advanced(CLUTCH_ENGAGE); is_parked = 1; uart_send_string("!!! Car in gear. APPLY HANDBRAKE !!!\r\n"); bt_send_string("PARKED. Apply handbrake!\r\n"); led_set_pattern(4); }
void exit_parking_mode(void) { if (!is_parked) return; uart_send_string(">>> EXIT PARKING <<<\r\n"); activity_reset_timer(); if (current_gear != 0) { shift_gear_limp_safe(0); HAL_Delay(500); } is_parked = 0; uart_send_string("Ready.\r\n"); bt_send_string("Unparked.\r\n"); led_set_pattern(current_drive_mode != DRIVE_MODE_NORMAL ? 2 : 0); }
void parking_monitor_task(void) { uint16_t rpm = get_rpm_universal(); if (rpm < 100) { if (engine_off_timer == 0) engine_off_timer = HAL_GetTick(); else if ((HAL_GetTick() - engine_off_timer) > 3000 && !shifting_in_progress) execute_parking_mode(); } else { engine_off_timer = 0; if (is_parked && rpm > 500) exit_parking_mode(); } }
void awd_init(void) { GPIO_InitTypeDef g = { 0 }; __HAL_RCC_GPIOB_CLK_ENABLE(); g.Pin = awd_config.awd_enable_pin; g.Mode = GPIO_MODE_OUTPUT_PP; g.Speed = GPIO_SPEED_FREQ_LOW; HAL_GPIO_Init(GPIOB, &g); HAL_GPIO_WritePin(GPIOB, awd_config.awd_enable_pin, GPIO_PIN_RESET); awd_engaged = 0; }
void awd_set_engaged(uint8_t en) { if (en == awd_engaged) return; if (en) { HAL_GPIO_WritePin(GPIOB, awd_config.awd_enable_pin, GPIO_PIN_SET); HAL_Delay(awd_config.awd_engage_delay_ms); awd_engaged = 1; awd_engagement_time = HAL_GetTick(); uart_send_string("[AWD] Engaged\r\n"); } else { HAL_GPIO_WritePin(GPIOB, awd_config.awd_enable_pin, GPIO_PIN_RESET); awd_engaged = 0; uart_send_string("[AWD] Disengaged\r\n"); } }
uint8_t get_wheel_speed_diff(void) { uint8_t front = front_wheel_speed_raw / 10; uint8_t rear = rear_wheel_speed_raw / 10; return (front > rear) ? (front - rear) : (rear - front); }
void awd_auto_task(void) { static uint32_t last = 0; uint32_t now = HAL_GetTick(); if (now - last < 100) return; last = now; uint8_t diff = get_wheel_speed_diff(); uint8_t spd = get_speed_universal(); switch (current_awd_mode) { case AWD_MODE_2WD: if (awd_engaged) awd_set_engaged(0); break; case AWD_MODE_AUTO: if (diff >= awd_config.awd_auto_speed_diff) { if (!awd_engaged) awd_set_engaged(1); } else if (awd_engaged && spd > 15) awd_set_engaged(0); break; case AWD_MODE_LOCK: if (!awd_engaged) awd_set_engaged(1); if (awd_config.awd_lock_timeout_s > 0 && (now - awd_engagement_time) > (awd_config.awd_lock_timeout_s * 1000)) { uart_send_string("[AWD] LOCK timeout -> AUTO\r\n"); current_awd_mode = AWD_MODE_AUTO; awd_set_engaged(0); } break; case AWD_MODE_LOW: if (!awd_engaged) awd_set_engaged(1); if (spd > 40) { uart_send_string("[AWD] Speed high for LOW\r\n"); current_awd_mode = AWD_MODE_AUTO; } break; } }
                                                                                                                                                                                                                                                      void awd_set_mode(AwdMode m) { if (m == current_awd_mode) return; if ((m == AWD_MODE_LOCK || m == AWD_MODE_LOW) && get_speed_universal() > 30) { uart_send_string("AWD blocked: speed high\r\n"); return; } current_awd_mode = m; const char* n[] = { "2WD","AUTO","LOCK","LOW" }; char msg[64]; snprintf(msg, sizeof(msg), ">>> AWD: %s <<<\r\n", n[m]); uart_send_string(msg); bt_send_string(msg); }

                                                                                                                                                                                                                                                      /* Analog tachometer TIM4 initialization (already declared) */
                                                                                                                                                                                                                                                      static void MX_TIM4_Init(void) {
                                                                                                                                                                                                                                                          __HAL_RCC_TIM4_CLK_ENABLE(); __HAL_RCC_GPIOB_CLK_ENABLE();
                                                                                                                                                                                                                                                          GPIO_InitTypeDef g = { 0 }; g.Pin = GPIO_PIN_6; g.Mode = GPIO_MODE_AF_PP; g.Pull = GPIO_NOPULL; g.Speed = GPIO_SPEED_FREQ_LOW; HAL_GPIO_Init(GPIOB, &g);
                                                                                                                                                                                                                                                          TIM_ClockConfigTypeDef sClk = { 0 }; TIM_MasterConfigTypeDef sMaster = { 0 }; TIM_IC_InitTypeDef sIC = { 0 };
                                                                                                                                                                                                                                                          htim4.Instance = TIM4; htim4.Init.Prescaler = 72 - 1; htim4.Init.CounterMode = TIM_COUNTERMODE_UP; htim4.Init.Period = 0xFFFF; htim4.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1; htim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
                                                                                                                                                                                                                                                          if (HAL_TIM_IC_Init(&htim4) != HAL_OK) Error_Handler();
                                                                                                                                                                                                                                                          sClk.ClockSource = TIM_CLOCKSOURCE_INTERNAL; HAL_TIM_ConfigClockSource(&htim4, &sClk);
                                                                                                                                                                                                                                                          sMaster.MasterOutputTrigger = TIM_TRGO_RESET; sMaster.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE; HAL_TIMEx_MasterConfigSynchronization(&htim4, &sMaster);
                                                                                                                                                                                                                                                          sIC.ICPolarity = TIM_ICPOLARITY_RISING; sIC.ICSelection = TIM_ICSELECTION_DIRECTTI; sIC.ICPrescaler = TIM_ICPSC_DIV1; sIC.ICFilter = 0; HAL_TIM_IC_ConfigChannel(&htim4, &sIC, TIM_CHANNEL_1);
                                                                                                                                                                                                                                                          HAL_NVIC_SetPriority(TIM4_IRQn, 2, 0); HAL_NVIC_EnableIRQ(TIM4_IRQn);
                                                                                                                                                                                                                                                          HAL_TIM_IC_Start_IT(&htim4, TIM_CHANNEL_1);
                                                                                                                                                                                                                                                      }
                                                                                                                                                                                                                                                      /* Correct interrupt handler for HAL */
                                                                                                                                                                                                                                                      void TIM4_IRQHandler(void) {
                                                                                                                                                                                                                                                          /* This function automatically clears the interrupt flag and calls the Callback below */
                                                                                                                                                                                                                                                          HAL_TIM_IRQHandler(&htim4);
                                                                                                                                                                                                                                                      }

                                                                                                                                                                                                                                                      /* Callback function called by HAL upon pulse capture */
                                                                                                                                                                                                                                                      void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef* htim) {
                                                                                                                                                                                                                                                          if (htim->Instance == TIM4) {
                                                                                                                                                                                                                                                              uint32_t now = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_1);

                                                                                                                                                                                                                                                              if (tacho_last_capture != 0) {
                                                                                                                                                                                                                                                                  uint32_t diff = now - tacho_last_capture;
                                                                                                                                                                                                                                                                  /* Handle timer overflow (if the pulse arrived after the 65535 overflow) */
                                                                                                                                                                                                                                                                  if (now < tacho_last_capture) {
                                                                                                                                                                                                                                                                      diff = (0xFFFF - tacho_last_capture) + now;
                                                                                                                                                                                                                                                                  }

                                                                                                                                                                                                                                                                  /* Filter out abnormally large values (engine is off) */
                                                                                                                                                                                                                                                                  if (diff < 60000) {
                                                                                                                                                                                                                                                                      tacho_period_us = diff;
                                                                                                                                                                                                                                                                  }
                                                                                                                                                                                                                                                              }
                                                                                                                                                                                                                                                              tacho_last_capture = now;
                                                                                                                                                                                                                                                          }
                                                                                                                                                                                                                                                      }
                                                                                                                                                                                                                                                      void read_analog_tacho(void) {
#define TACHO_PULSES_PER_REV 2
                                                                                                                                                                                                                                                          if (tacho_period_us > 0) { float freq = 1000000.0f / (float)tacho_period_us; engine_rpm_analog = (uint16_t)((freq / TACHO_PULSES_PER_REV) * 60.0f + 0.5f); }
                                                                                                                                                                                                                                                          else engine_rpm_analog = 0;
                                                                                                                                                                                                                                                      }
                                                                                                                                                                                                                                                      /* end of gearbox_controller.c */